SPedt/src/Documents/ОтчетБухгалтеру/ОтчетБухгалтеру.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтчетБухгалтеру</name>
  <registerRecords>AccumulationRegister.Обмен100СПрн_Ошибки</registerRecords>
  <attributes>
    <name>СуммаВозмещаемаяПунктуВыдачи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчет</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойПунктВыдачи</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОтчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьФайла</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьФайлаРазбор</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьОтчета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьОтчетаКД</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьОтчетаВР</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКурьерскихЗаказов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВозмещаемаяНаСайте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

SPedt/src/Documents/ОтчетБухгалтеру/ObjectModule.bsl
Процедура СохранитьОтправитьФайлыОтчетов(ПериодОтчета) экспорт
	Дата			= КонецМесяца(ПериодОтчета);
	Если не ЗначениеЗаполнено(СвойПунктВыдачи) Тогда
		СвойПунктВыдачи = Константы.СвояТочка.Получить();
	КонецЕсли;
	каталогнаЯД 	= Формат(Дата,"ДФ=yyyy_MM;")+"_xls";
	каталогМесяц 	= Формат(Дата,"ДФ=yyyy_MM;");
	
	Если константы.РазборНаЕРЦОтправлятьОтчет.Получить() Тогда
		
		ПутьОтчетаВР 		= ПутьКФайлу("ВР","xlsx");
		СохраненОтчетБВ	= СП_Отчеты.СохранитьОтчетВозмещениеЗаРазборЕРЦXLSX(ПутьОтчетаВР, Дата);
		Если СохраненОтчетБВ Тогда
			Если СоздатьКаталогНаЯД(каталогнаЯД) Тогда
				ОтправленОтчетВР = ОтправитьНаЯД(каталогнаЯД, ПутьОтчетаВР);
			иначе	
				ОтправленОтчетВР = Ложь;
			КонецЕсли;
		КонецЕсли;	
		
		ПутьФайлаРазбор 		= ПутьКФайлу("РазборНаЕРЦ","txt");
		СохраненРазбор	= СоздатьФайлВозмещенияЗаРазбор(ПутьФайлаРазбор);
		Если СохраненРазбор Тогда
			Если СоздатьКаталогНаЯД(каталогМесяц) Тогда
				ОтправленФайлВР = ОтправитьНаЯД(каталогМесяц, ПутьФайлаРазбор);
			иначе	
				ОтправленФайлВР = Ложь;
			КонецЕсли;
		КонецЕсли;	
	Иначе	
		ОтправленФайлВР = Истина;
		ОтправленОтчетВР = Истина;
	КонецЕсли;
	
	Если константы.БесплатнаяВыдачаОтправлятьОтчет.Получить() Тогда
		
		ПутьОтчета 		= ПутьКФайлу("БВ","xlsx");
		СохраненОтчетБВ	= СП_Отчеты.СохранитьОтчетПоБесплатнойВыдачеXLSX(ПутьОтчета, Дата);
		Если СохраненОтчетБВ Тогда
			
			Если СоздатьКаталогНаЯД(каталогнаЯД) Тогда
				ОтправленОтчет = ОтправитьНаЯД(каталогнаЯД, ПутьОтчета);
			иначе	
				ОтправленОтчет = Ложь;
			КонецЕсли;
		КонецЕсли;	
		
		ПутьОтчетаКД 		= ПутьКФайлу("КД","xlsx");
		СохраненОтчетКД	= СП_Отчеты.СохранитьОтчетПоКурьерскойДоставкеXLSX(ПутьОтчетаКД, Дата);
		Если СохраненОтчетКД Тогда
			
			Если СоздатьКаталогНаЯД(каталогнаЯД) Тогда
				ОтправленОтчетКД = ОтправитьНаЯД(каталогнаЯД, ПутьОтчетаКД);
			иначе	
				ОтправленОтчетКД = Ложь;
			КонецЕсли;
		КонецЕсли;	
		
		
		ПутьФайла 		= ПутьКФайлу("Свод","txt");
		
		СохраненСвод	= СоздатьФайлБесплатнойВыдачи(ПутьФайла);
		Если СохраненСвод Тогда
			
			Если СоздатьКаталогНаЯД(каталогМесяц) Тогда
				ОтправленФайл = ОтправитьНаЯД(каталогМесяц, ПутьФайла);
			иначе	
				ОтправленФайл = Ложь;
			КонецЕсли;
		КонецЕсли;	
	Иначе	
		ОтправленОтчет = истина;
		ОтправленФайл = истина;
		ОтправленОтчетКД = истина;
		
	КонецЕсли;

	
	
	Отправлено = (ОтправленОтчетВР и ОтправленФайлВР и ОтправленОтчет и ОтправленФайл и ОтправленОтчетКД);	
	Если Отправлено Тогда
		СинхронизацияПоступлений.ЗаписатьДатуЗапретаСОписанием(Дата, "Установлено отчетом по бесплатной выдаче");
	КонецЕсли	
	
КонецПроцедуры





Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	Документы.ОтчетБухгалтеру.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	ДополнительныеСвойства.Вставить("ЭтоНовый",ЭтоНовый());
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	СП_ДвиженияСервер.ОтразитьДвиженияПоРегистру("Обмен100СПрн_Ошибки", ДополнительныеСвойства, Движения, Отказ);
КонецПроцедуры
		




Функция СоздатьКаталогНаЯД(каталогМесяц)
	результат 		= Интеграция_Яндекс.СоздатьКаталогНаДиске("/FreeStorage/"+каталогМесяц);
	Возврат (Результат.КодСостояния = 200  Или Результат.КодСостояния = 201);
КонецФункции	


Функция ОтправитьНаЯД(каталогМесяц, ПутьКФайлу)
	ф = новый Файл(ПутьКФайлу);
	Если не ф.Существует() Тогда Возврат Ложь; КонецЕсли;
	
	АдресФайлаВоВременномХранилище = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПутьКФайлу));	
	
	параметрыФайла 					= Новый Структура;
	параметрыФайла.Вставить("ПутьКФайлу", "/FreeStorage/" + каталогМесяц + "/" + ф.Имя);
	параметрыФайла.Вставить("ДвоичныеДанные", АдресФайлаВоВременномХранилище);
	Результат =  Интеграция_Яндекс.ВыгрузитьНаДиск(параметрыФайла);
	Возврат (Результат.КодСостояния = 200 Или Результат.КодСостояния = 201);
КонецФункции
	


Функция ПутьКФайлу(Название,Расширение)
	КаталогХранения	= Справочники.ТомаХраненияФайлов.БесплатнаяВыдача.ПолныйПутьWindows;
	КодПВ 				= Формат(число(СвойПунктВыдачи.Код),"ЧЦ=4; ЧВН=; ЧГ=0;");
	НаименованиеПВ		= СтрЗаменить(СвойПунктВыдачи.Наименование,"-" ,"_" );
	ИмяФайла 			= Название + "_" +формат(Дата,"ДФ=yyyy_MM_;") + КодПВ+"_"+НаименованиеПВ;		

	ПутьКФайлу	 	= КаталогХранения + ИмяФайла + "." +Расширение;
	
	Возврат ПутьКФайлу;
КонецФункции	





Функция СоздатьФайлБесплатнойВыдачи(ПутьФайла)
	файлТХТ 		= новый ТекстовыйДокумент();	
	
	тз				= СП_Отчеты.ТаблицаБесплатнойВыдаче(Дата);
	СуммаВозмещаемаяПунктуВыдачи = тз.Итог("Сумма"); 
	СуммаВозмещаемаяНаСайте = тз.Итог("ОплатилУчастник");
	
	тз				= СП_Отчеты.ТаблицаКурьерскойДоставке(Дата);
	КоличествоКурьерскихЗаказов = тз.Итог("Количество");
	
	
	
	ПВ 			= Формат(число(СвойПунктВыдачи.Код),"ЧЦ=4; ЧВН=; ЧГ=0;");
	ТекстФайла = 	"sbv="+Формат(СуммаВозмещаемаяПунктуВыдачи,"ЧГ=0;")+";"+Символы.ПС +
					"kkd="+формат(КоличествоКурьерскихЗаказов,"ЧГ=0;")+";"+Символы.ПС + 
	   				"sou="+Формат(СуммаВозмещаемаяНаСайте,"ЧГ=0;")+";"+Символы.ПС +	
			    	"pv="+ПВ+";";
	файлТХТ.УстановитьТекст(ТекстФайла);
	
	Попытка
		а =Новый файл(ПутьФайла);
		Если а.Существует() Тогда
			а.УстановитьТолькоЧтение(Ложь);
		КонецЕсли;
		файлТХТ.Записать(ПутьФайла);
		Возврат Истина;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
КонецФункции


Функция СоздатьФайлВозмещенияЗаРазбор(ПутьФайла)
	файлТХТ 		= новый ТекстовыйДокумент();	
	
	тз				= СП_Отчеты.ТаблицаВозмещениеЗаРазборНаЕРЦ(Дата);
	ТекстФайла = "";
	Для каждого элем из тз Цикл
		
		ПВ 			= Формат(число(Элем.ПунктВыдачи.Код),"ЧЦ=4; ЧВН=; ЧГ=0;");
		ТекстФайла = ТекстФайла +	"kol="+Формат(элем.Количество,"ЧГ=0;")+";"+"pvkod="+ПВ+";"+"pvnaim="+Элем.ПунктВыдачи.наименование+";"+"city="+Элем.ГородПунктаВыдачи.наименование+";"+Символы.ПС ;
	//		    	"pv="+ПВ+";";	тз[1].ГородПунктаВыдачи
		
		
	КонецЦикла;
	//СуммаВозмещаемаяПунктуВыдачи = тз.Итог("Сумма");
	//
	//тз				= СП_Отчеты.ТаблицаКурьерскойДоставке(Дата);
	//КоличествоКурьерскихЗаказов = тз.Итог("Количество");
	//
	//
	//
	//ПВ 			= Формат(число(СвойПунктВыдачи.Код),"ЧЦ=4; ЧВН=; ЧГ=0;");
	//ТекстФайла = 	"sbv="+Формат(СуммаВозмещаемаяПунктуВыдачи,"ЧГ=0;")+";"+Символы.ПС +
	//				"kkd="+формат(КоличествоКурьерскихЗаказов,"ЧГ=0;")+";"+Символы.ПС +
	//		    	"pv="+ПВ+";";
	файлТХТ.УстановитьТекст(ТекстФайла);
	
	Попытка
		а =Новый файл(ПутьФайла);
		Если а.Существует() Тогда
			а.УстановитьТолькоЧтение(Ложь);
		КонецЕсли;
		файлТХТ.Записать(ПутьФайла);
		Возврат Истина;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
КонецФункции




Процедура ПриЗаписи(Отказ)
	ПВ 			= Формат(число(СвойПунктВыдачи.Код),"ЧЦ=4; ЧВН=; ЧГ=0;");
	имяОтчета 	= формат(Дата,"ДФ=yyyy_MM_;") + ПВ
КонецПроцедуры
